In [36]:
import pandas as pd

In [37]:
df = pd.read_csv('analytics.csv', names=['idx', 'd', 'p', 'profit', 'expense', 'baseCt', 'returnCost'])

In [38]:
df.shape

(121188, 7)

In [39]:
df.head()

   idx   d  p  profit  expense  baseCt  returnCost
0    1  29  4    1044      216      19          88
1    2  11  1      66       36      16          78
2    3  24  7    2016      315      10         455
3    4  28  7    2352      315      18         826
4    5   5  1      30       44      17         119

In [40]:
df[df['profit'] < df['expense']].shape

(2378, 7)

In [41]:
df['totalExpense'] = df['expense'] + df['p'] * 240 / df['baseCt'] + df['returnCost'] / df['baseCt']

In [42]:
df.head()

   idx   d  p  profit  expense  baseCt  returnCost  totalExpense
0    1  29  4    1044      216      19          88    271.157895
1    2  11  1      66       36      16          78     55.875000
2    3  24  7    2016      315      10         455    528.500000
3    4  28  7    2352      315      18         826    454.222222
4    5   5  1      30       44      17         119     65.117647

In [43]:
(df['profit'] - df['totalExpense']).sum()

51600428.99999999

In [44]:
df[df['profit'] < df['totalExpense']].shape

(9413, 8)

In [50]:
waste = df[df['profit'] < df['totalExpense']].copy()

In [51]:
(waste['profit'] - waste['totalExpense']).sum()

-1073031.6039091605

In [52]:
waste['loss'] = waste['totalExpense'] - waste['profit']

In [54]:
waste.sort_values('loss').tail()

       idx   d  p  profit  expense  baseCt  returnCost  totalExpense    loss
99565   98  16  6    1056      828       1         732        3000.0  1944.0
58022  231  11  7     924      819       1         742        3241.0  2317.0
16149  181   9  6     594      768       1         714        2922.0  2328.0
72533  560  17  6    1122     1110       1        1008        3558.0  2436.0
83116  340  13  6     858     1074       1         996        3510.0  2652.0

In [56]:
waste.groupby('baseCt')['loss'].sum()

baseCt
1     430351.000000
2     128417.500000
3      68172.666667
4      47688.000000
5      32891.400000
6      24285.000000
7      15517.714286
8      18316.250000
9      15616.333333
10     15175.900000
11     18515.363636
12     17028.166667
13     16891.384615
14     18448.857143
15     21179.800000
16     23718.312500
17     25977.000000
18     22886.611111
19     25385.263158
20     20051.550000
21     22207.761905
22     17785.818182
23     12629.043478
24      7226.333333
25      3415.080000
26      1855.192308
27      1189.444444
28       208.857143
Name: loss, dtype: float64

In [57]:
waste.groupby('p')['loss'].sum()

p
1    111695.970153
2    148689.049966
3    174258.566236
4    168193.547948
5    186161.335388
6    147102.575085
7    136930.559134
Name: loss, dtype: float64

In [58]:
waste.groupby('d')['loss'].sum()

d
5     104864.422407
6      74911.939697
7      50174.184746
8      43425.324405
9      37987.945640
10     32479.662289
11     29090.691141
12     28194.613932
13     23412.571898
14     21716.619263
15     13573.561688
16     26569.796005
17     23340.956859
18     25697.685328
19     29463.631423
20     29633.904648
21     31115.875065
22     36033.111500
23     36774.574799
24     34305.033333
25     50035.603832
26     40855.754941
27     62867.217312
28     67314.117230
29     49190.995798
30     70001.808730
Name: loss, dtype: float64